##### Feature Engineering for Missing Categorical data - Part 2

#### ordinal Encoding

In [1]:
import datetime

In [2]:
date_time = datetime.datetime.today()

In [3]:
date_time

datetime.datetime(2021, 5, 27, 10, 25, 12, 621799)

In [4]:
date_time-datetime.timedelta(3)

datetime.datetime(2021, 5, 24, 10, 25, 12, 621799)

In [5]:
days=[date_time-datetime.timedelta(x) for x in range(0,15)]

In [6]:
import pandas as pd

In [7]:
df =pd.DataFrame(days)
df.columns=["Days"]

In [8]:
df.head()

                        Days
0 2021-05-27 10:25:12.621799
1 2021-05-26 10:25:12.621799
2 2021-05-25 10:25:12.621799
3 2021-05-24 10:25:12.621799
4 2021-05-23 10:25:12.621799

In [9]:
df['Weekday']=df['Days'].dt.day_name()
df.head(7)

                        Days    Weekday
0 2021-05-27 10:25:12.621799   Thursday
1 2021-05-26 10:25:12.621799  Wednesday
2 2021-05-25 10:25:12.621799    Tuesday
3 2021-05-24 10:25:12.621799     Monday
4 2021-05-23 10:25:12.621799     Sunday
5 2021-05-22 10:25:12.621799   Saturday
6 2021-05-21 10:25:12.621799     Friday

In [10]:
diction={"Monday":1,"Tuesday":2,"Wednesday":3,"Thursday":4,"Friday":5,"Saturday":6,"Sunday":7}

In [11]:
diction

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [12]:
df['Weekday_ordinal']=df['Weekday'].map(diction)

In [13]:
df.head()

                        Days    Weekday  Weekday_ordinal
0 2021-05-27 10:25:12.621799   Thursday                4
1 2021-05-26 10:25:12.621799  Wednesday                3
2 2021-05-25 10:25:12.621799    Tuesday                2
3 2021-05-24 10:25:12.621799     Monday                1
4 2021-05-23 10:25:12.621799     Sunday                7

#### Count or Frequency Encoding

In [14]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [15]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [16]:
train_set[1].value_counts()

 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: 1, dtype: int64

In [17]:
train_set=train_set.select_dtypes(include=object)
train_set

,1,3,5,6,7,8,9,13,14
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States,<=50K
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States,>50K
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States,<=50K
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States,<=50K
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States,>50K

In [18]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country','Salary']

In [19]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country,Salary
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K

In [20]:
print(len(train_set['Degree'].value_counts()))

16

In [21]:
def dummy(x):
    print(x,':',len(train_set[x].value_counts()))

In [22]:
cols= list(train_set.columns)

In [23]:
print(cols)

['Employment', 'Degree', 'Status', 'Designation', 'family_job', 'Race', 'Sex', 'Country', 'Salary']

In [24]:
for y in cols:
    dummy(y)

Employment : 9
Degree : 16
Status : 7
Designation : 15
family_job : 6
Race : 5
Sex : 2
Country : 42
Salary : 2

In [25]:
Country_map=train_set['Country'].value_counts().to_dict()

In [26]:
train_set['Country']=train_set['Country'].map(Country_map)

In [27]:
train_set.drop(['Salary'], axis=1,inplace=True)

In [28]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Target Guided Ordinal Encoading

In [29]:
df=pd.read_csv('titanic_train.csv', usecols=['Survived','Cabin'])

In [30]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [31]:
df['Cabin'].fillna('Missing',inplace=True)

In [32]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [33]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [34]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [36]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [37]:
df.groupby(df['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [38]:
df.groupby(df['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [39]:
Ordinal_lable=df.groupby(df['Cabin'])['Survived'].mean().sort_values().index
Ordinal_lable

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [40]:
Ordinal_lable2={k:i for i,k in  enumerate(Ordinal_lable,0)}
Ordinal_lable2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [41]:
df['Cabin']=df['Cabin'].map(Ordinal_lable2)

In [42]:
df.head()

   Survived  Cabin
0         0      1
1         1      4
2         1      1
3         1      4
4         0      1

#### Mean Encoding

In [47]:
df=pd.read_csv('titanic_train.csv', usecols=['Survived','Cabin'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [53]:
df['Cabin'].fillna('Missing',inplace=True)

In [56]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [57]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [60]:
mapto = df.groupby(df['Cabin'])['Survived'].mean().to_dict()

In [61]:
df['Cabin']=df['Cabin'].map(mapto)

In [62]:
df.head()

   Survived     Cabin
0         0  0.299854
1         1  0.593220
2         1  0.299854
3         1  0.593220
4         0  0.299854